In [9]:
a = 1

In [10]:
b = 2
c = 5

In [11]:
print(a)

1

In [12]:
print(b)

2

In [13]:
print(c)

5

In [21]:
a + b

3

In [15]:
import pandas as pd

In [17]:
df1 = pd.DataFrame([1,2,3,4])

In [27]:
entries = {
    'maths': [60,70,80,50,55], 
    'science':[50,75,81,54,35]
    }

In [28]:
df1 = pd.DataFrame(entries)

In [29]:
df1

   maths  science
0     60       50
1     70       75
2     80       81
3     50       54
4     55       35

In [30]:
df1

   maths  science
0     60       50
1     70       75
2     80       81
3     50       54
4     55       35

In [38]:
df1['maths']

0    60
1    70
2    80
3    50
4    55
Name: maths, dtype: int64

In [39]:
df1.loc[0]

maths      60
science    50
Name: 0, dtype: int64

In [40]:
entries = {
    'maths': [60], 
    'science':[50]
    }

In [41]:
df2 = pd.DataFrame(entries)

In [42]:
df2

   maths  science
0     60       50

In [44]:
df3 = pd.concat([df1, df2])

In [45]:
df3

   maths  science
0     60       50
1     70       75
2     80       81
3     50       54
4     55       35
0     60       50

In [52]:
df4 = df3.reset_index()

In [54]:
df4[~df4['index']]

KeyError: "None of [Int64Index([-1, -2, -3, -4, -5, -1], dtype='int64')] are in the [columns]"

In [55]:
df4.drop('index')

KeyError: "['index'] not found in axis"

In [56]:
df4

   index  maths  science
0      0     60       50
1      1     70       75
2      2     80       81
3      3     50       54
4      4     55       35
5      0     60       50

In [62]:
df5 = df4.drop(['index'], axis=1)

In [63]:
df5

   maths  science
0     60       50
1     70       75
2     80       81
3     50       54
4     55       35
5     60       50

In [64]:
entries_3 = {
    'maths': [70], 
    'science':[None]
    }

In [65]:
df7 = pd.DataFrame(entries_3)

In [67]:
df7.fillna(0)

   maths  science
0     70        0

In [68]:
df8 = pd.concat([df5, df7])

In [69]:
df8

   maths science
0     60      50
1     70      75
2     80      81
3     50      54
4     55      35
5     60      50
0     70    None

In [70]:
df8

   maths science
0     60      50
1     70      75
2     80      81
3     50      54
4     55      35
5     60      50
0     70    None

In [81]:
# Replace none with 0
df8

   maths  science
0     60       50
1     70       75
2     80       81
3     50       54
4     55       35
5     60       50
0     70        0

In [83]:
def get_total(row):
    print(row)
    return row['maths'] + row['science']

In [85]:
df8['total'] = df8.apply(get_total, axis=1)

maths      60
science    50
Name: 0, dtype: int64
maths      70
science    75
Name: 1, dtype: int64
maths      80
science    81
Name: 2, dtype: int64
maths      50
science    54
Name: 3, dtype: int64
maths      55
science    35
Name: 4, dtype: int64
maths      60
science    50
Name: 5, dtype: int64
maths      70
science     0
Name: 0, dtype: int64

In [86]:
df8

   maths  science  total
0     60       50    110
1     70       75    145
2     80       81    161
3     50       54    104
4     55       35     90
5     60       50    110
0     70        0     70

In [95]:
def get_percentage(row):
    return row['total'] / 200 * 100

In [96]:
df8['percentage'] = df8.apply(get_percentage, axis=1)

In [97]:
df8

   maths  science  total  percentage
0     60       50    110        55.0
1     70       75    145        72.5
2     80       81    161        80.5
3     50       54    104        52.0
4     55       35     90        45.0
5     60       50    110        55.0
0     70        0     70        35.0

In [98]:
def get_pass_status(row):
    if row['percentage'] < 50:
        return 'Failed'
    else:
        return 'Passed'

In [99]:
df8['result'] = df8.apply(get_pass_status, axis=1)

In [101]:
df8

   maths  science  total  percentage  result
0     60       50    110        55.0  Passed
1     70       75    145        72.5  Passed
2     80       81    161        80.5  Passed
3     50       54    104        52.0  Passed
4     55       35     90        45.0  Failed
5     60       50    110        55.0  Passed
0     70        0     70        35.0  Failed

In [102]:
df9 = df8[df8['result'] == 'Passed']

In [103]:
df9

   maths  science  total  percentage  result
0     60       50    110        55.0  Passed
1     70       75    145        72.5  Passed
2     80       81    161        80.5  Passed
3     50       54    104        52.0  Passed
5     60       50    110        55.0  Passed

In [107]:
df9.to_csv('passed_students.csv')

In [108]:
df9.mean(axis=0)

C:\Users\animesh\AppData\Local\Temp\ipykernel_7504\366823610.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df9.mean(axis=0)

maths          64.0
science        62.0
total         126.0
percentage     63.0
dtype: float64

In [111]:
df9[['maths', 'science']].mean()

maths      64.0
science    62.0
dtype: float64

In [113]:
df9['maths'].std()

11.40175425099138

In [114]:
entries_10 = {'history': ['1', '2', '3', '4', '5']}

In [115]:
df11 = pd.DataFrame(entries_10)

In [116]:
df11

  history
0       1
1       2
2       3
3       4
4       5

In [144]:
df9

   maths  science  total  percentage  result
0     60       50    110        55.0  Passed
1     70       75    145        72.5  Passed
2     80       81    161        80.5  Passed
3     50       54    104        52.0  Passed
5     60       50    110        55.0  Passed

In [145]:
df12 = pd.concat([df9, df11], axis = 1)

In [146]:
df12

   maths  science  total  percentage  result history
0   60.0     50.0  110.0        55.0  Passed       1
1   70.0     75.0  145.0        72.5  Passed       2
2   80.0     81.0  161.0        80.5  Passed       3
3   50.0     54.0  104.0        52.0  Passed       4
5   60.0     50.0  110.0        55.0  Passed     NaN
4    NaN      NaN    NaN         NaN     NaN       5

In [147]:
df12 = df12.reset_index()

In [148]:
df12 = df12.reindex(sorted(df12.columns), axis=1)

In [149]:
df12 = df12.drop(['index'], axis=1)

In [150]:
df12['passed'] = df12.apply(get_pass_status, axis=1)

In [151]:
df12

  history  maths  percentage  result  science  total  passed
0       1   60.0        55.0  Passed     50.0  110.0  Passed
1       2   70.0        72.5  Passed     75.0  145.0  Passed
2       3   80.0        80.5  Passed     81.0  161.0  Passed
3       4   50.0        52.0  Passed     54.0  104.0  Passed
4     NaN   60.0        55.0  Passed     50.0  110.0  Passed
5       5    NaN         NaN     NaN      NaN    NaN  Passed